#
# .zsh_plugins.txt - antidote plugins file
#

## Overview
# The `.zsh_plugins.txt` file is used by antidote to configure Zsh bundles. Bundles are
# just a fancy way of referring to Zsh utilities, frameworks, prompts, or plugins.
#
# NOTE: Order matters in this file! Some bundles need to be last, and others are
# prerequisites. Read the documentation for the plugins you use to ensure proper
# configuration.
#
# Example: https://github.com/getantidote/zdotdir/blob/main/.zsh_plugins.txt

### Local Plugins
#
# Plugins don't have to come from GitHub. You can also use local files or directories to
# host your own custom plugins.
#
###
$ZDOTDIR/.zaliases


#
# Init
#

mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew conditional:is-macos


#
# History
#

mattmc3/zephyr path:plugins/history
larkery/zsh-histdb pre:init_histdb

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

mattmc3/zephyr path:plugins/editor
# jeffreytse/zsh-vi-mode
# sorin-ionescu/prezto path:modules/editor
# romkatv/zsh-no-ps2
$ZDOTDIR/lib/zsh-no-ps2.zsh

#
# Prompts
#

# sindresorhus/pure kind:fpath
# romkatv/powerlevel10k kind:fpath
# miekg/lean kind:fpath
mattmc3/zephyr path:plugins/prompt


#
# Misc
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/utility
# mattmc3/zephyr path:plugins/zfunctions
# mattmc3/zephyr path:plugins/confd

# https://github.com/junegunn/fzf
mattmc3/zsh_custom path:plugins/fzf

# https://github.com/ajeetdsouza/zoxide
# Initializes zoxide, a smarter cd command for your terminal.
# ajeetdsouza/zoxide
mattmc3/zsh_custom path:plugins/zoxide

# https://github.com/Aloxaf/fzf-tab
# fzf-tab needs to be loaded after compinit, but before plugins which will wrap widgets,
# such as zsh-autosuggestions or fast-syntax-highlighting!!
aloxaf/fzf-tab

junegunn/fzf-git.sh

paulirish/git-open

bigH/git-fuzzy kind:path path:bin

sorin-ionescu/prezto path:modules/ssh

# orbstack/orbstack

#
# macOS
#

mattmc3/zephyr path:plugins/macos conditional:is-macos

## Deferred Plugins
# In general, you should not defer plugins unless you know for sure they properly support
# deferred loading, and there are no adverse side-effects. However, for certain plugins,
# this can greatly increase your zsh startup speed.
#
# https://github.com/romkatv/zsh-defer#Caveats

# zdharma-continuum/fast-syntax-highlighting kind:defer
# zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
# zsh-users/zsh-history-substring-search

# vi: ft=properties
